BenchBnB/app/controllers/api/benches_controller.rb

SELECT "benches".* FROM "benches"
---
  def index
    @benches = Bench.all