BenchBnB/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]
---
  def self.find_by_credentials(un, pw)
    user = User.find_by(username: un)